app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (title LIKE '%%')
---
  def index
    # 모든 것을 보여주는 곳...
      @posts = Post.where("title LIKE ?", "%#{params["q"]}%") #검색

INSERT INTO "posts" ("title", "content", "postimage", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "2222"], ["content", ""], ["postimage", "Chrysanthemum.jpg"], ["user_id", 3], ["created_at", "2018-01-04 05:44:50.318935"], ["updated_at", "2018-01-04 05:44:50.318935"]]
---
  def create
    current_user.posts.create(post_params)

UPDATE "posts" SET "postimage" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["postimage", "Desert.jpg"], ["updated_at", "2018-01-04 05:48:52.362489"], ["id", 2]]
---
  def update
    # @post = Post.find(params[:id]) #코드 중복 방지
    @post.update(post_params)